Repository: LittleSecrets/development
Catalog: dev_application/modules/zfmyadmin/data/locales/*.po
Languages: ru, uk

source: Module name changed in accordance to Zend standards, your input was:
ru: Имя модуля изменено в соответствии со стандартами Zend, вы ввели:
uk: Ім'я модулю змінено у відповідності зі стандартами Zend, ви ввели:

source: Module %name% not created(not enough rights), TODO saved to log
ru: Модуль %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: Модуль %name% не створено (недостатньо прав), список "До виконання" збережено в лог

source: Module %name% not created, TODO not saved(not enough rights)
ru: Модуль %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: Модуль %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Module %name% created
ru: Модуль %name% создан
uk: Модуль %name% створено

source: Create module
ru: Создать модуль
uk: Створити модуль

source: Controller name changed in accordance to Zend standards, your input was:
ru: Имя контроллера изменено в соответствии со стандартами Zend, вы ввели:
uk: Ім'я контролеру змінено у відповідності зі стандартами Zend, ви ввели:

source: Controller %name% not created(not enough rights), TODO saved to log
ru: Контроллер %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: Контролер %name% не створено (недостатньо прав), список "До виконання" збережено в лог

source: Controller %name% not created, TODO not saved(not enough rights)
ru: Контроллер %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: Контролер %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Controller %name% created
ru: Контроллер %name% создан
uk: Контролер %name% створено

source: Create controller
ru: Создать контроллер
uk: Створити контроллер

source: Action name changed in accordance to Zend standards, your input was:
ru: Имя Action'а изменено в соответствии со стандартами Zend, вы ввели:
uk: Ім'я Action змінено у відповідності зі стандартами Zend, ви ввели:

source: Action %name% not created(not enough rights), TODO saved to log
ru: Action %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: Action %name% не створено (недостатньо прав), список "До виконання" збережено в лог

source: Action %name% not created, TODO not saved(not enough rights)
ru: Action %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: Action %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Action %name% created
ru: Action %name% создан
uk: Action %name% створено

source: Create Action
ru: Создать Action
uk: Створити Action

source: Css %name% not created(not enough rights), TODO saved to log
ru: CSS %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: CSS %name% не створено, список "До виконання" збережено в лог

source: Css %name% not created, TODO not saved(not enough rights)
ru: CSS %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: CSS %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Css %name% created
ru: CSS %name% создан
uk: CSS %name% створено

source: Create Css
ru: Создать CSS
uk: Створити CSS

source: Js %name% not created(not enough rights), TODO saved to log
ru: JS %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: JS %name% не створено (недостатньо прав), список "До виконання" збережено в лог

source: Js %name% not created, TODO not saved(not enough rights)
ru: JS %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: JS %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Js %name% created
ru: JS %name% создан
uk: JS %name% створено

source: Create Js
ru: Создать JS
uk: Створити JS

source: Router %name% not created(not enough rights), TODO saved to log
ru: Router %name% не создан (недостаточно прав), список "К выполнению" сохранен в лог
uk: Router %name% не створено (недостатньо прав), список "До виконання" збережено в лог

source: Router %name% not created, TODO not saved(not enough rights)
ru: Router %name% не создан, список "К выполнению" не сохранен (недостаточно прав)
uk: Router %name% не створено, список "До виконання" не збережено (недостатньо прав)

source: Router %name% created
ru: Router %name% создан
uk: Router %name% створено

source: Create Route
ru: Создать route
uk: Створити Route

source: No logged in user to access this data
ru: Для доступа к данным нужно залогиниться
uk: Для перегляду даних потрібно залогінитися

source: This operation has another owner
ru: У этой операции есть другой владелец
uk: Дана операція має іншого власника

source: intention of operaition expired
ru: намерение по операции устарело
uk: команда "До виконання" застаріла

source: Project settings saved
ru: Настройки проекта сохранены
uk: Налаштування проекту збережено

source: Modules directory is non writable
ru: Запрещена запись в папку модуля
uk: Директорія modules не підлягає запису

source: Directory configs are non writable
ru: Запрещена запись в папку configs
uk: Директорія configs не підлягає запису

source: is non writable
ru: не подлежит записи
uk: не підлягає запису

source: Invalid connection parameters or database disabled
ru: Неправильные параметры соединения или не включена БД
uk: Невірні параметри з'єднання або вимкнено БД

source: Data base adapter does not exist
ru: Адаптер БД не существует
uk: Адаптер БД не існує

source: Public files not extracted
ru: Публичные файлы не были извлечены
uk: Публічні файли не було видобуто

source: zfmyadmin.ini file not created
ru: файл zfmyadmin.ini не был создан
uk: файл zfmyadmin.ini не було створено

source: zfmyadmin database tables not created
ru: таблицы БД для zfmyadmin не были созданы
uk: таблиці БД для zfmyadmin не було створено

source: I want to uninstall ZfMyAdmin and permanently remove all its files and folders
ru: Я хочу удалить ZfMyAdmin вместе со всеми его файлами и папками
uk: Я хочу видалити ZfMyAdmin разом з усіма його файлами та директоріями

source: zfmyadmin database tables not removed. Please remove manually
ru: таблицы БД для zfmyadmin не были удалены. Пожалуйста, удалите вручную
uk: таблиці БД для zfmyadmin не было видалено. Будь-ласка, зробіть це вручну

source: not removed. Please remove manually
ru: не удалены. Пожалуйста, удалите вручную
uk: не было видалено. Будь-ласка, зробіть це вручну

source: not removed. Please remove folder of zfmyadmin module manually
ru: не удалены. Пожалуйста, удалите папку модуля zfmyadmin вручную
uk: не было видалено. Будь-ласка, видаліть директорію модулю zfmyadmin вручну

source: Uninstall complete
ru: Удаление завершено
uk: Видалення завершено

source: If zfmyadmin folder still remains in the project, please remove it manually
ru: Если папка zfmyadmin осталась в проекте, пожалуйста, удалите ее вручную
uk: Якщо директорія zfmyadmin не була видалено автоматично, будь-ласка, зробіть це вручну

source: Uninstall errors
ru: Ошибки удаления
uk: Помилки видалення

source: User %name% removed
ru: Пользователь %name% удален
uk: Користувач %name% видалений

source: Rights for user %name% changed
ru: Права для пользователя %name% изменены
uk: Права для користувача %name% змінено

source: User %name% created
ru: Пользователь %name% создан
uk: Користувач %name% створений

source: Your settings changed
ru: Ваши настройки изменены
uk: Ваші налаштування змінено

source: You do not have rights to change these settings
ru: У вас нет прав для изменения данных настроек
uk: Ви не маєте прав для зміни цих налаштувань

source: An error occured, settings not saved!
ru: Ошибка, настройки не сохранены!
uk: Помилка, налаштування не збережено!

source: Your password changed
ru: Ваш пароль изменен
uk: Ваш пароль змінено

source: Password not confirmed!
ru: Пароль не подтвержден!
uk: Пароль не підтверждено!

source: '%value%' contains characters which are non alphabetic and no digits
ru: '%value%' содержит символы, которые не являются буквами латинского алфавита или цифрами
uk: '%value%' містить символи, які не є літерами латинського алфавіту або цифрами

source: '%value%' is an empty string
ru: '%value%' - пустая строка
uk: '%value%' - пуста строка

source: '%value%' contains non alphabetic characters
ru: '%value%' содержит символы, которые не являются буквами
uk: '%value%' містить символи, які не є літерами

source: '%value%' must contain only digits
ru: '%value%' должно содержвать только цифры
uk: '%value%' має складатися виключно з цифр

source: Invalid type given. String expected
ru: Неверный тип. Требуется строка
uk: Невірний тип. Потрібен рядок

source: '%value%' is not valid email address in the basic format local-part@hostname
ru: '%value%' не является валидными email адресом в базовом формате local-part@hostname
uk: '%value%' не є валідною email адресою у базовому форматі local-part@hostname

source: '%hostname%' is not valid hostname for email address '%value%'
ru: '%hostname%' не является валидным именем хоста для email адреса '%value%'
uk: '%hostname%' не є валідним ім'ям хосту для email адреси '%value%'

source: '%hostname%' does not appear to have a valid MX record for the email address '%value%'
ru: '%hostname%' не имеет валидной MX записи для email адреса '%value%'
uk: '%hostname%' не має валідного MX запису для email адреси '%value%'

source: '%hostname%' is not in a routable network segment. The email address '%value%' should not be resolved from public network
ru: '%hostname%' не является маршрутизируемым сегментом сети. Email адрес '%value%' не должен использоваться в публичных сетях
uk: '%hostname%' не є маршрутизованим сегментом мережі. Email адреса '%value%' не повинна використовуватися у публічних мережах

source: The two given tokens do not match
ru: Введенные значения не совпадают
uk: Введенні значення не співпадають

source: No token was provided to match against
ru: Вы не ввели значение для сравнения
uk: Ви не ввели перше значення для порівняння

source: '%value%' was not found in the haystack
ru: '%value%' не найден в списке
uk: '%value%' не знайдено в списку

source: Invalid type given. String or integer expected
ru: Неверный тип. Требуется строка или целое число
uk: Невірний тип. Потрібен рядок або ціле число

source: '%value%' does not appear to be an integer
ru: '%value%' не является целым числом
uk: '%value%' не є цілим числом

source: Value is required and can't be empty
ru: Поле обязательно для заполнения и не может быть пустым
uk: Поле є обов'язковим і не може бути пустим

source: Invalid type given. String, integer, float, boolean or array expected
ru: Неверный тип. Требуется строка, целое число, вещественное число, булево значение или массив
uk: Невірний тип. Потрібен рядок, ціле число, реальне число, булеве значення або масив

source: '%value%' does not match against pattern '%pattern%'
ru: '%value%' не соответствует паттерну '%pattern%'
uk: '%value%' не відповідає патерну '%pattern%'

source: '%value%' is less than %min% characters long
ru: '%value%' меньше чем %min% символов в длину
uk: '%value%' менше ніж %min% символів

source: '%value%' is more than %max% characters long
ru: '%value%' более чем %max% символов в длину
uk: '%value%' більше ніж %max% символів

source: Submit
ru: Отправить
uk: Надіслати

source: New password
ru: Новый пароль
uk: Новий пароль

source: Confirm password
ru: Подтвердите пароль
uk: Підтвердіть пароль

source: Get TODO
ru: К выполнению
uk: До виконання

source: Project root
ru: Корневая директория проекта
uk: Коренева директорія проекту

source: Path to public folder
ru: Путь к папке public
uk: Шлях до директорії public

source: Use separate database
ru: Использовать отдельную БД
uk: Використовувати окрему БД

source: Host
ru: Хост
uk: Хост

source: Username
ru: Имя пользователя
uk: Им'я користувача

source: Password
ru: Пароль
uk: Пароль

source: Database
ru: База данных
uk: База даних

source: Adapter
ru: Адаптер
uk: Адаптер

source: Public directory (the one for your CSS and JS files)
ru: Публичная директория (для хранения файлов CSS и JS)
uk: Public directory (для зберігання файлів CSS та JS)

source: Directory for views of controllers in modules
ru: Директория для views контроллеров в модуле
uk: Директорія для views контролерів в модулі

source: Put styles and JS to separate directories for each module
ru: Помещать стили и JS в отдельные папки для каждого модуля
uk: Поміщати стилі та JS в окремі директорії для кожного модулю

source: Directory for .css files (inside Public folder)
ru: Директория для файлов .css (внутри Публичной директории)
uk: Директорія для файлів .css (всередені Public)

source: Directory for .js files (inside Public folder)
ru: Директория для файлов .js (внутри Публичной директориии)
uk: Директорія для файлів .js (всередені Public)

source: File to store your routers (must be .php or .ini)
ru: Файл для хранения ваших router'ов (должен быть .php или .ini)
uk: Файл для зберігання ваших router'ів (має бути .php або .ini)

source: Variable containing router object of class Zend_Controller_Router_Rewrite (for .php only)
ru: Переменная, содержащая объект router'а класса Zend_Controller_Router_Rewrite (только .php)
uk: Змінна, яка містить об'ект router'у класу Zend_Controller_Router_Rewrite (тільки .php)

source: Hash
ru: Хэш
uk: Хеш

source: Create User
ru: Создать пользователя
uk: Створити користувача

source: Save
ru: Сохранить
uk: Зберегти

source: Delete
ru: Удалить
uk: Видалити

source: Your name
ru: Ваше имя
uk: Ваше им'я

source: Company
ru: Компания
uk: Компанія

source: Save my changes to log
ru: Сохранять мою работу в лог
uk: Зберігати мою роботу в лог

source: Save my changes to project
ru: Сохранять мою работу в проект
uk: Зберігати мою роботу в проект

source: Include route to project
ru: Включать route в проект
uk: Включати route в проект

source: Include route to project in .ini format
ru: Включать route в проект в формате .ini
uk: Включати маршрут у проект в форматі .ini

source: Use module name as package name
ru: Использовать имя модуля как имя пакета
uk: Використовувати ім'я модулю як ім'я пакету

source: Your package name
ru: Ваше имя пакета
uk: Ваше ім'я пакету

source: Use file type as package name (controllers, views, js, css ...)
ru: Использовать тип файла как имя пакета (controllers, views, js, css ...)
uk: Використовувати тип файлу в якості імені пакету (controllers, views, js, css ...)

source: Your subpackage name
ru: Ваше имя субпакета
uk: Ваше ім'я субпакету

source: Use company name as copyright
ru: Использовать название компании как копирайт
uk: Використовувати назву компанії як копірайт

source: Your copyright
ru: Ваш копирайт
uk: Ваш копірайт

source: Your license
ru: Ваша лицензия
uk: Ваша ліцензія

source: Your version
ru: Ваша версия
uk: Ваша версія

source: Use my name and e-mail
ru: Использовать мое имя и e-mail
uk: Використовувати моє ім'я та e-mail

source: Your author name
ru: Ваше имя автора
uk: Ваше ім'я автора

source: TODO
ru: К выполнению
uk: До виконання

source: Get intention
ru: Создать намерение
uk: До виконання

source: Module name
ru: Имя модуля
uk: Имя модулю

source: Create module Bootstrap.php
ru: Создать модуль Bootstrap.php
uk: Створити модуль Bootstrap.php

source: Create module application.ini
ru: Создать модуль application.ini
uk: Створити модуль application.ini

source: Include controller CSS file to project
ru: Подключить CSS контроллера к проекту
uk: Підключати CSS файл контролеру до проекту

source: Include action CSS file to project
ru: Подключить CSS action'а к проекту
uk: Підключати CSS файл action'у до проекту

source: Add documentation code
ru: Добавить код документации
uk: Додати код документації

source: Include controller JS file to project
ru: Подключить JS контроллера к проекту
uk: Підключати JS файл контролеру до проекту

source: Include action JS file to project
ru: Подключить JS-файл action'а к проекту
uk: Підключати JS файл action'у до проекту

source: Create [production] section
ru: Создать раздел [production]
uk: Створити розділ [production]

source: Class Bootstrap of module
ru: Класс Bootstrap модуля
uk: Клас Bootstrap модулю

source: <span class="error"> Does not exist </span>
ru: <span class="error"> Не существует </span>
uk: <span class="error"> Не існує </span>

source: Insert router
ru: Введите роутер
uk: Введіть роутер

source: Action does not exist!
ru: Action не существует!
uk: Action не існує!

source: Invalid action name
ru: Некорректное имя action'а
uk: Некоректне ім'я action'у

source: Action already exists!
ru: Action уже существует!
uk: Action вже існує!

source: In this module such controller does not exist!
ru: В этом модуле такой контроллер не существует!
uk: Даний модуль не містить такого контролеру!

source: Invalid controller name
ru: Некорректное имя контролера
uk: Некоректне ім'я контролеру

source: In this module such controller already exists!
ru: В этом модуле такой контроллер уже существует!
uk: У даному модулі такий контролер вже існує!

source: Directory does not exist!
ru: Директория не существует!
uk: Директорія не існує!

source: Class does not extend Zend_Controller_Action!
ru: Класс не наследует Zend_Controller_Action!
uk: Клас не наслідує Zend_Controller_Action!

source: Class does not exist!
ru: Класс не существует!
uk: Клас не існує!

source: Module does not exist!
ru: Модуль не существует!
uk: Модуль не існує!

source: Invalid module name
ru: Неверное имя модуля
uk: Некоректне ім'я модулю

source: Module already exists!
ru: Модуль уже существует!
uk: Модуль вже існує!

source: '%value%' not correct variable name
ru: '%value%' неправильное имя переменной
uk: '%value%' не є коректним ім'ям змінної

source: Create directory
ru: Создать директорию
uk: Створити директорію

source: Create file
ru: Создать файл
uk: Створити файл

source: in file
ru: в файле
uk: у файлі

source: Create class
ru: Создать класс
uk: Створити клас

source: Create action
ru: Создать action
uk: Створити action

source: Create method
ru: Создать метод
uk: Створити метод

source: Create route
ru: Создать route
uk: Створити route

source: Saved to log
ru: Сохранено в лог
uk: Збережено в лог

source: Saved to log, file(s) and code added to project
ru: Сохранено в лог, файл(ы) и код добавлены в проект
uk: Збережено в лог, файл(и) та код додані до проекту

source: Saved to log, failed to save file(s) and code to project
ru: Сохранено в лог, не удалось добавить файл(ы) и код в проект
uk: Збережено в лог, не вдалося додати файл(и) та код до проекту

source: Create code
ru: Создать код
uk: Створити код

source: Login
ru: Вход
uk: Вхід

source: Manage users
ru: Управление пользователями
uk: Управління користувачами

source: My settings
ru: Мои настройки
uk: Мої налаштування

source: Project settings
ru: Настройки проекта
uk: Налаштування проекту

source: Uninstall
ru: Удалить
uk: Видалити

source: Uninstall zfmyadmin
ru: Удалить zfmyadmin
uk: Видалити zfmyadmin

source: Logout
ru: Выход
uk: Вихід

source: Module
ru: Модуль
uk: Модуль

source: Controller
ru: Контроллер
uk: Контролер

source: Create css
ru: Создать CSS
uk: Створити CSS

source: Create js
ru: Создать JS
uk: Створити JS

source: Create router
ru: Создать роутер
uk: Створити роутер

source: Complete
ru: Выполнено
uk: Виконано

source: Copyright ZfMyAdmin Team, 2012.
ru: Copyright команда ZfMyAdmin, 2012.
uk: Copyright команда ZfMyAdmin, 2012.

source: Details of operation
ru: Подробности операции
uk: Деталі операції

source: Description
ru: Описание
uk: Опис

source: Generated code
ru: Сгенерированный код
uk: Згенерований код

source: Generated code in file
ru: Сгенерированный код в файле
uk: Згенерований код у файлі

source: Copy to clipboard
ru: Копировать в буфер
uk: Копіювати в буфер

source: Code successfully copied!
ru: Код успешно скопирован!
uk: Код успішно скопійовано!

source: Route name
ru: Имя route'а
uk: Имя route'у

source: Variables
ru: Переменные
uk: Змінні

source: Variable name
ru: Имя переменной
uk: Імена змінних

source: Default value
ru: Переменная по умолчанию
uk: Значення за умовчанням

source: Add variable
ru: Добавить переменную
uk: Долати змінну

source: Choose module
ru: Выберите модуль
uk: Оберіть модуль

source: Choose controller
ru: Выберите контроллер
uk: Оберіть контролер

source: Choose action
ru: Выберите action
uk: Оберіть action

source: Set as project settings
ru: Сохранить как настройки проекта
uk: Зберегти як налаштування проекту

source: Set as my settings
ru: Сохранить как мои настройки
uk: Зберегти як мої налаштування

source: zfmyadmin default settings
ru: настройки zfmyadmin по умолчанию
uk: налаштування zfmyadmin за умовчанням

source: project default settings
ru: настройки проекта по умолчанию
uk: налаштування проекту за умовчанням

source: user settings
ru: настройки пользователя
uk: налаштування користувача

source: Js & Css
ru: JS и CSS
uk: JS та CSS

source: Router
ru: Роутер
uk: Роутер

source: Create view
ru: Создать view
uk: Створити view

source: Create javascript file
ru: Создать JavaScript файл
uk: Створити JavaScript файл

source: Create css file
ru: Создать CSS файл
uk: Створити CSS файл

source: Include javascript and css file to controller
ru: Подключать JavaScript и CSS файлы в контроллере
uk: Підключати файли JavaScript и CSS в контролері

source: Class
ru: Класс
uk: Клас

source: Extends class of controller
ru: Наследует класс контроллера
uk: Наслідує клас контролеру

source: Choose methods
ru: Выберите методы
uk: Оберіть методи

source: Create javascript file for controller
ru: Создать JavaScript файл для контроллера
uk: Створити JavaScript файл для контролеру

source: Create css file for controller
ru: Создать CSS файл для контроллера
uk: Створити CSS файл для контролеру

source: Create css file for action
ru: Создать CSS файл для action'а
uk: Створити CSS файл для action'у

source: Include css file in controller
ru: Подключить CSS файлы в контроллере
uk: Підключити CSS файл в контролері

source: Create js file for controller
ru: Создать JS файл для контроллера
uk: Створити JS файл для контролеру

source: Create js file for action
ru: Создать JS файл для action'а
uk: Створити JS файл для action'у

source: Include js file in controller
ru: Подключить JS файлы в контроллере
uk: Підключити JavaScript файли в контролері

source: Existing modules names
ru: Существующие имена модулей
uk: Існуючі імена модулів

source: Directories
ru: Директории
uk: Директорії

source: Bootstrap and configs
ru: Bootstrap и configs
uk: Bootstrap та configs

source: Existing actions names
ru: Существующие имена action'ов
uk: Існуючі імена action'ів

source: Existing controller names
ru: Существующие именя контроллеров
uk: Існуючі імена контролерів

source: Operation id
ru: ID операции
uk: ID операції

source: Status
ru: Статус
uk: Статус

source: This page will be available in url
ru: Эта страница будет доступна по адресу
uk: Сторінка буде доступна за адресою

source: URL will be generated by the default router
ru: URL будет сгенерирован router'ом по умолчанию
uk: URL буде згенерований router'ом по умовчанню

source: URL will be generated by your router
ru: URL будет сгенерирован вашим router'ом
uk: URL буде згенерований вашим router'ом

source: Welcome to ZfMyAdmin!
ru: Добро пожаловать в ZfMyAdmin!
uk: Вітаємо у ZfMyAdmin!

source: Please select the item you want to create in the left menu.
ru: Пожалуйста, выберите элемент, который вы хотите создать, в меню слева.
uk: Будь-ласка, оберіть елемент, який ви хочете створити, у меню зліва.
