Repository: LittleSecrets/development
Catalog: dev_application/modules/zfmyadmin/data/locales/*.po
Languages: ru, uk

source: To add routes to your project, you need to insert special label to the file with routes (to the place where you want routes to be). For .php files it is /*zfmyadmin routers*/, for .ini files - ;zfmyadmin routers
ru: Чтобы добавить route'ы в ваш проект, вам нужно вставить специальный ярлык в файл с route'ами (в то место, где вы хотите видеть route'ы). Для .php файлов это /*zfmyadmin routers*/, для .ini файлов - ;zfmyadmin routers
uk: Щоб додати route'и до вашго проекту, вам потрібно вставити спеціальний ярлик у файл з route'ами (в те місце, де ви хочете бачити route'и ). Для .php файлів це /*zfmyadmin routers*/, для .ini файлів - ;zfmyadmin routers

source: ZfMyAdmin Installation Page
ru: Страница установки ZfMyAdmin
uk: Сторінка установки ZfMyAdmin

source: Please fill in the form below to finish installation process.
ru: Пожалуйста, заполните форму для завершения процесса установки.
uk: Будь-ласка, заповніть форму для завершення процесу установки.

source: Note that none of the existing project files, database tables and project settings will be changed during the installation. ZfMyAdmin allows you to uninstall itself without affecting the rest of the project, including the changes made by means of ZfMyAdmin.
ru: Обратите внимание, что существующие файлы проекта, таблицы БД и настройки не будут изменены в ходе установки. Вы сможете легко удалить ZfMyAdmin, не изменив при этом проект (в т.ч. и изменения, сделанные при помощи ZfMyAdmin).
uk: Зверніть уваги, що існуючі файли проекту, таблиці БД та налаштування не будуть змінені в ході установки. Ви зможете легко видалити ZfMyAdmin, не змінюючи при цьому проект (в т.ч. і зміни, внесені за допомогою ZfMyAdmin).

source: When you submit the form:
ru: Когда вы отправляете форму:
uk: Коли ви відправляєте форму:

source: In the Public folder a new folder <span class="folder">zfmyadmin_public</span> will be created.
ru: В Публичной директории будет создана новая папка <span class="folder">zfmyadmin_public</span>.
uk: В Public директорії буде створено нову теку <span class="folder">zfmyadmin_public</span>.

source: New tables required for ZfMyAdmin to run will be created in a separate or existing database.
ru: Новые таблицы, необходимые для функционирования ZfMyAdmin, будут созданы в существующией или отдельной БД.
uk: Нові таблиці, потрібні для функціонування ZfMyAdmin, будуть створені в існуючій або окремій БД.

source: ZfMyAdmin module will be configured to work properly within your application.
ru: Модуль ZfMyAdmin будет сконфигурирован для работы в вашем приложении.
uk: Модуль ZfMyAdmin буде сконфігурований для роботи у вашому додатку.

source: 2012 ZfMyAdmin team, all rights reserved.
ru: 2012 Команда ZfMyAdmin, все права защищены.
uk: 2012 Команда ZfMyAdmin, всі права захищено.

source: Uninstall ZfMyAdmin Module
ru: Удалить модуль ZfMyAdmin
uk: Видалити модуль ZfMyAdmin.

source: Change password
ru: Новый пароль
uk: Змінити пароль

source: User management
ru: Управление пользователями
uk: Управління користувачами

source: Register new user
ru: Зарегистрировать нового пользователя
uk: Зареєструвати нового користувача

source: Set user rights
ru: Установить права пользователей
uk: Встановити права користувачів

source: Name
ru: Имя
uk: Ім'я

source: Login to account
ru: Войти в аккаунт
uk: Увійти в акаунт

source: User settings
ru: Настройки пользователя
uk: Налаштування користувача

source: Personal data
ru: Личные данные
uk: Персональні дані

source: Commit settings
ru: Настройки коммита
uk: Налаштування коміту

source: Documentation settings
ru: Настройки документации
uk: Налаштування документації

source: Codegenerator settings
ru: Настройки кодогенератора
uk: Налаштування кодогенератору

source: Specify dockblock tags you want to use for files, classes and methods
ru: Укажите теги докблока, которые вы хотите видеть в файлах, классах и методах
uk: Вкажіть теги докблоку, які ви бажаєте бачити у файлах, класах та методах

source: php files
ru: php файлы
uk: php файли

source: classes
ru: классы
uk: класи

source: methods
ru: методы
uk: методи

source: css files
ru: файлы CSS
uk: файли CSS

source: js files
ru: файлы JS
uk: файли JS

source: Show in php files docblock
ru: Показывать в докблоке php файлов
uk: Показувати в докблоці php файлів

source: Show in classes docblock
ru: Показывать в докблоке классов
uk: Показувати в докблоці класів

source: Show in methods docblock
ru: Показывать в докблоке методов
uk: Показувати в докблоці методів

source: Show in phtml files of view docblock
ru: Показывать в phtml файлах вида докблока
uk: Показувати phtml файлах view докблоку

source: Show in public css files docblock
ru: Показывать в докблоках публичных CSS файлов
uk: Показувати в докблоках публічних CSS файлів

source: Show in public js files docblock
ru: Показывать в докблоке публичных JS файлов
uk: Показувати в докблоках публічних JS файлів
